#================================================<Import>======================================================#
import numpy as np
import math
from HW3_utils import FKHW3
#==============================================================================================================#
# file สำหรับเขียนคำตอบ
# ในกรณีที่มีการสร้าง function อื่น ๆ ให้ระบุว่า input-output คืออะไรด้วย
'''
ชื่อ_รหัส(ธนวัฒน์_6461)
1. ไกรวิชญ์_6504
2. ธนเนศพล_6527
'''
#=============================================<คำตอบข้อ 1>======================================================#
#code here
def endEffectorJacobianHW3(q:list[float])->list[float]:
    # คำนวณ ForwordKinematic เพื่อหา R, P, R_e,P_e
    R,P,R_e,p_e = FKHW3(q)

    # สร้างตัวแปรขนาด 3x3 ของ Linear และ Angular Jacobian
    J_v = np.empty((3,3))
    J_w = np.empty((3,3))

    #เอาจำนวณของ  Joint โดยเอาจาก q ที่ Input เข้ามา
    num_joint = len(q)
    
    for i in range(num_joint):
        # คำนวณค่า rotation joint ที่ i
        rotation = np.dot(R[:,:,i],[[0],[0],[1]]) # 

        # ระยะห่างระหว่าง p_e และ p joint ที่ i
        diffrent = p_e - P[:,i] #

        # หา Linear velocity สำหรับ Jacobian
        J_transpose = np.cross(rotation,diffrent) #

    
        pass
    return rotation
#==============================================================================================================#
#=============================================<คำตอบข้อ 2>======================================================#
#code here
def checkSingularityHW3(q:list[float])->bool:
    pass
#==============================================================================================================#
#=============================================<คำตอบข้อ 3>======================================================#
#code here
def computeEffortHW3(q:list[float], w:list[float])->list[float]:
    pass
#==============================================================================================================#